<template>
    <div class="flex items-center justify-center">
        <div class="w-3/4 bg-slate-800 mt-10 rounded-lg p-5">
            <h2 class="text-left text-lg"> Определение функции</h2>
            <hr class="border-slate-700 my-2.5" />
            <p class="mt-3">
                TypeScript также как и javascript определяет функцию с помощью ключевого слова function, но при этом добавляет дополнительные возможности по работе с функциями. В частности, теперь мы можем определить тип передаваемых параметров и тип возвращаемого значения.
            </p>
            <p class="mt-3">
                Параметры функции - Функция может иметь параметры, которые указываются после названия функции в скобках через запятую. Через двоеточие после имени параметра указывается его тип <br />
                При этом функция может не только использовать передаваемые параметры, но и глобальные переменные, определенные во вне
            </p>
            <p class="mt-3">
                Результат функции - Функция может возвращать значение определенного типа, который еще называется типом функции. Возвращаемый тип функции ставится после списка параметров через двоеточие <br />
                <code class="text-teal-500">function add(a: number, b: number): number </code> <br />
                Если функция ничего не возвращает, то указывается тип void. В принципе мы можем и не указывать тип, тогда он будет выводиться неявно на основе возвращаемого значения
            </p>
            <p class="mt-3">
                В typescript при вызове в функцию должно передаваться ровно столько значений, сколько в ней определено параметров <br />
                <code class="text-teal-500">function getName(firstName: string, lastName: string) </code> <br />
                Чтобы иметь возможность передавать различное число значений в функцию, в TS некоторые параметры можно объявить как необязательные. Необязательные параметры должны быть помечены вопросительным знаком ?. Причем необязательные параметры должны идти после обязательных: <br />
                <code class="text-teal-500">function getName(firstName: string, lastName?: string) </code> <br />
            </p>
            <p class="mt-3">
                Параметры позволяют задать начальное значение по умолчанию. И если для такого параметра не передается значение, то он использует значение по умолчанию <br />
                <code class="text-teal-500">function getName(firstName: string, lastName: string="Иванов")</code> <br />
                Причем в качестве значения можно передавать результат другого выражения <br />
            </p>
            <p class="mt-3">
                Если необходимо, чтобы функция принимала набор однотипных параметров, то используется знак многоточия, после которого идет массив <br />
                <code class="text-teal-500">function addNumbers(firstNumber: number, ...numberArray: number[]): number </code> <br />
            </p>
        </div>
    </div>
</template>

<script setup lang="ts">

</script>

<style scoped>

</style>